#მეგობრებო, ქვემოთ კომენტარის სახედ მოცემულია დავალების პირობები. ყოველი ამოცანის ქვეშ დაწერეთ თქვენი პასუხი. პითონ ფაილის ჩამოტვირთვისას დააწერეთ davaleba 3 - elena bliadze.py 
# ოღონდ elena bliadze -ს ნაცვლად თქვენი სახელი და გვარი. გისურვებთ წარმატებას ! ასევე გაითვალისწინეთ მოცემული დავალება ფოლდერით უნდა ატვირთოთ გითჰაბზე და ლინკი კომენტარში დაურთოთ თქვენს მიერ ატვირთულ დავალებას.
#გისურვებთ წარმატებას!

# დაწერე (ჩაფასთე მარჯვნივ(გასწვრივ)) გითჰაბის ლინკი, სადაც ატვირთე შენი ფაილი: https://github.com/ilarion123/ilara-rep.git

#1. დაწერეთ პროგრამა, რომლის მეშვეობით შეიყვანთ  (input-ითით) 15 მონაცემს.
# წარმოადგინეთ და დაბეჭდეთ ისინი სიის ელემენტების სახის.

# arr=[]
# for i in range(15):
#     x=input("sheiyvane monacemi:")
#     arr.append(x)
# print(arr)

#2. დაწერეთ პროგრამა, რომელიც რიცხვითი მნიშვნელობების სიაში ამოშლის ლუწ რიცხვებს. დაბეჭდეთ მიღებული სია. 


# arr=[1,2,3,4,5,6,7,8,9,10,3,3,3,5,6,7,1]
# kentebi=[]
# for i in arr:
#     if i%2!=0: 
#         kentebi.append(i)
# print(kentebi)

#3. შექმენით 5 ელემენტიანი სია (რიცხვითი მნიშვნელობებით). თითოეული ელემენტი გაზარდეთ 10 ით და დაბეჭდეთ ახალი სია.

# arr=[11,21,22,54,76]
# sia=[]
# for i in arr:
#     sia.append(i+10)
# print(sia)


#4. შექმენით 10 ელემენტიანი სია, რომლის ელემენტებია ნებისმიერი შემთხვევითი მთელი
# რიცხვები 10 დან 120 მდე. დაბეჭდეთ სია და იპოვეთ მინიმალური ელემენტი. გამოიყენე გენერატორი.

# import random
# arr=[random.randint(10,120) for i in range(10)]
# print(arr)
# minimaluri=min(arr)
# print(minimaluri)

#5. მოიფიქრე და დაწერე ლისტებისთვის პროგრამა split მეთოდის გამოყენებით.

# winadadeba="i like studying lists"
# splitis_shemdeg=winadadeba.split()
# print(splitis_shemdeg)

#6. მოიფიქრე და დაწერე ლისტებისთვის პროგრამა join მეთოდის გამოყენებით.

# arr=['I', 'like', 'studying', 'lists']
# joinn=" ".join(arr)
# print(joinn)

#7. იპოვეთ სიაში [1, 5, 23, 5, 12, 2, 5, 1, 18, 5 } ყველაზე ხშირად განმეორებადი რიცხვი.
# დაბეჭდეთ შედეგი. ასევე მიუთითეთ რამდენჯერ შეგხვდათ სიაში ყველაზე ხშირად განმეორებადი რიცხვი.

# listt=[1, 5, 23, 5, 12, 2, 5, 1, 18, 5 ]
# ramdenjer=0
# xshir_iricxvi=listt[0]
# for i in listt:
#     raodenoba=listt.count(i)
#     if raodenoba>ramdenjer:
#         xshir_iricxvi=i
#         ramdenjer=raodenoba
# print(xshir_iricxvi)
# print(ramdenjer)

# 8. შექმენით სია რიცხვითი ელემენტებით.shuffle ფუნქციის გამოყენებით ( random მოდულიდან) მოახდინეთ
# სიის ელემენტების შემთხვევითად არევა და დაბეჭდეთ მიღებული სია.

# import random
# arr=[1,2,3,4,5,6,7,8,9,10]
# random.shuffle(arr)
# print(arr)

#9.შექმენით სია extensions = ['txt', 'jpg', 'gif', 'html']. პროგრამის გაშვების შემდეგ
# მომხამრებელმა შეიყვანოს ( input) ნებისმიერი ფაილის დასახელება. თუ ფაილის გაფართოება ემთხევა
# სიის რომელიმე ელემენტს, დაბეჭდოს ეკრანზე “Yes”, წინააღმდეგ შემთხვავაში დაბეჭდოს “ No”.

# extensions = ['txt', 'jpg', 'gif', 'html']
# filename=input("sheiyvane failis dasaxeleba:")
# if filename in extensions:
#     print("YES")
# else:
#     print("NO")

#10. შეიტანეთ სიის 10 ელემენტი. იპოვეთ ამ რიცხვების საშუალო არითმეტიკული, მედიანა და მოდა.
# გაითვალისწინეთ, მედიანა წარმოადგენს შუა ელემენტს, როდესაც რიცხვები დალაგებულია ზრდადობით
# (ან კლებადობით); თუ შუაში ორი ელემენტია, მაშინ მედიანა არის ამ შუა ელემენტების საშუალო
# არითმეტიკული. მოდა, არის მიმდევრობაში რიცხვი, რომელიც ყველაზე ხშირად გვხვდება. შეიძლება
# მიმდევრობას არ ქონდეს მოდა (თუ ყველა ელემენტს ერთნაირი სიხშირე აქვს), ან ქონდეს ერთი ან
# რამდენიმე მოდა.


# arr=[1,4,1,5,9,2,6,5,5,3]
# sashualo=sum(arr)/len(arr)
# print(sashualo)

# arr.sort()
# x=len(arr)
# mediana1=arr[(x-1)//2]+arr[x//2]
# mediana=mediana1/2
# print(mediana)

# ramdenjer=0
# moda=arr[0]
# for i in arr:
#     raodenoba=arr.count(i)
#     if raodenoba>ramdenjer:
#         moda=i
#         ramdenjer=raodenoba
# print(moda)
