# შექმენით ფუნქცია, რომელსაც არგუმენტად გადაეცემა ორი რიცხვი და დაითვლის (დააბრუნებს)
# მათ საშუალო არითმეტიკულს. გამოიძახეთ ფუნქცია 3-ჯერ სხვადასხვა რიცხვებისთვის და
# დაბეჭდეთ შედეგი.

# def sashualo(a,b):
#     return (a+b)/2
# res1=sashualo(10,20)
# res2=sashualo(5,15)
# res3=sashualo(7,13)
# print(res1)
# print(res2)
# print(res3)

# დაწერეთ ფუნქცია, რომელსაც არგუმენტად გადაეცემა ორი რიცხვი და დაითვლის მათ საშუალო
# არითმეტიკულს და დაბეჭდავს შედეგს (გაითვალისწინეთ რომ დაბეჭდვა უნდა მოხდეს
# ფუნქციის შიგნით - ფუნქცია არ აბრუნებს მნიშვნელობას). გამოიძახეთ ფუნქცია 3-ჯერ
# სხვადასხვა რიცხვებისთვის.

# def sashualo(a,b):
#     average=(a+b)/2
#     print(average)
# sashualo(4,6)
# sashualo(10,20)
# sashualo(7,3)

# შექმენით ფუნქცია, რომელიც დაითვლის (დააბრუნებს) არგუმენტად გადაცემული რიცხვის
# კუბს. გამოიძახეთ ფუნქცია რამდენიმეჯერ და დაბეჭდეთ მიღებული შედეგი. 

# def kubi(number):
#     return number**3
# print(kubi(2))
# print(kubi(3))
# print(kubi(4))

# მოიფიქრე და შექმენი, ფუნქცია myfunc და ჩვენს მიერ ნასწავლი პირობებით შექმენი მინი
# შენთვის სასურველი პროგრამა.

# def myfunc(age):
#     if age>=18:
#         print("tqven srulwlovani xart")
#     else:
#         print("tqven arxart srulwlovani")
# myfunc(15)