#3. დაითვალეთ 1500-დან 2100-ის ჩათვლით 5-ის ჯერადი რიცხვების რაოდენობა. დაბეჭდეთ შედეგი.
# raodenoba=0
# for i in range(1500,2101,5):
#     raodenoba+=1
# print(raodenoba)
#  დაბეჭდეთ ეკრანზე 15-დან 150-მდე 5-ის ჯერადი რიცხვები გარდა 50-ის, 75, 80-ისა. გამოიყენეთ continue
# #ოპერატორი.
# for i in range(15,150,5):
#     if i==50 or i ==75 or i==80:
#         continue
#     print(i)
# 5. შეიყვანეთ ნებისმიერი 2 რიცხვი. ციკლის გამოყენებით დაბეჭდეთ შეყვანილი რიცხვების საერთო გამყოფები.
# მაგ. 15-ის და 18-ის საერთო გამყოფებია: 1, 3
